cask_args appdir: "/Applications"

tap "homebrew/services"
tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"

brew "curl", args: ["with-openssl"]
brew "dep"
brew "fish"
brew "git"
brew "go"
brew "icu4c"
brew "node"
brew "pcre2"
brew "python"
brew "ruby"
brew "starship"
brew "tree"
brew "wget"
brew "yarn"

cask "caffeine"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "hyper"
cask "phoenix"
cask "slack"
cask "the-unarchiver"
