cask_args appdir: "/Applications"

tap "homebrew/services"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
tap  "mongodb/brew"

brew "curl", args: ["with-openssl"]
brew "deno"
brew "dep"
brew "fish"
brew "gdbm"
brew "gettext"
brew "git"
brew "git-crypt"
brew "glances"
brew "gmp"
brew "go"
brew "htop"
brew "icu4c"
brew "isl"
brew "jq"
brew "k3d"
brew "k9s"
brew "kustomize"
brew "libmpc"
brew "mas"
brew "mongodb-community"
brew "mongodb-database-tools"
brew "mpfr"
brew "mysql"
brew "mysql-client"
brew "ncurses"
brew "node"
brew "nvm"
brew "oniguruma"
brew "openssl@1.1"
brew "pcre2"
brew "pkg-config"
brew "protobuf"
brew "python@3.9"
brew "readline"
brew "skaffold"
brew "sqlite"
brew "starship"
brew "terraform"
brew "whalebrew"
brew "xz"
brew "yarn"

cask "adguard"
cask "alfred"
cask "flutter"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "hyper"
cask "insomnia"
cask "jetbrains-toolbox"
cask "keepingyouawake"
cask "mongodb-compass"
cask "mysqlworkbench"
cask "obs"
cask "responsively"
cask "slack"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "vlc"

mas "1Password", id: 443987910
mas "jira", id: 1475897096
mas "Xcode", id: 497799835
